def nom1():
    dictionary = {'Россия':'Москва', 'Япония':'Токио', 'Китай':'Пекин', 'Италия':'Рим', 'Дания':'Копенгаген'}
    def a():
        print(dictionary)
    a()

    def b():
        print(dictionary['Китай'])
    b()

    def c():
        list_d = list(dictionary.keys())
        list_d.sort()
        for i in list_d:
            print(i, ':', dictionary[i])
            # будьте внимательны - через двоеточие в словаре передаются только пары ключ:значение
    c()
nom1()

def nom2():
    erydit = {'А':1, 'Б': 3, 'В': 1, 'Г': 3, 'Д': 2, 'Е': 1, 'Ё': 3, 'Ж': 5, 'З': 5, 'И': 1, 'Й': 4, 'К': 2, 'Л': 2, 'М': 2, 'Н': 1, 'О': 1, 'П': 2, 'Р': 1, 'С': 1, 'Т': 1, 'У': 2, 'Ф': 10, 'Х': 5, 'Ц': 5, 'Ч': 5, 'Ш': 8, 'Щ': 10, 'Ъ': 10, 'Ы': 4, 'Ь': 3, 'Э': 8, 'Ю': 8, 'Я': 3, 'а':1, 'б': 3, 'в': 1, 'г': 3, 'д': 2, 'е': 1, 'ё': 3, 'ж': 5, 'з': 5, 'и': 1, 'й': 4, 'к': 2, 'л': 2, 'м': 2, 'н': 1, 'о': 1, 'п': 2, 'р': 1, 'с': 1, 'т': 1, 'у': 2, 'ф': 10, 'х': 5, 'ц': 5, 'ч': 5, 'ш': 8, 'щ': 10, 'ъ': 10, 'ы': 4, 'ь': 3, 'э': 8, 'ю': 8, 'я': 3}
    slovo = input('Введите слово: ')
    sl = list(slovo)
    it = 0
    for i in sl:
        it = it + erydit[i]
    print(it)
nom2()

