#Task1
# print("Введите пароль: ")
# a = int(input())
# print("Подтвердите пароль: ")
# b = int(input())
# if a == b:
#     print("Пароль принят.")
# else:
#     print("Пароль не принят.")


#Task2
# print("Введите номер места: ")
# a = int(input())
# if a%2 == 0:
#     x = "Верхнее,"
# else:
#     x = "Нижнее,"
# if a > 36 and a < 55:
#     y = "Боковое место"
# elif a > 0 and a < 37:
#     y = "Купейное место"
# if a < 1 or a > 54:
#     x = "Такого места нет"
#     y = ""
# print(x, y)

#Task3
# print("Введите год: ")
# a = int(input())
# if a%4 == 0 and a%100 != 0 or a%400 == 0:
#     print("Год", a, "- високосный")
# else:
#     print("Этот год не високосный")

#Task4
# print("Введите первый цвет: ")
# a = input()
# print("Введите второй цвет: ")
# b = input()
# if a == "красный" or a == "Красный":
#     if b == "синий" or b == "Синий":
#         print("Вторичный цвет - фиолетовый")
#     elif b == "желтый" or b == "Желтый" or b == "Жёлтый" or b == "жёлтый":
#         print("Вторичный цвет - оранжевый")
#     else:
#         print("Другой цвет")
# elif a == "Синий" or a == "синий":
#     if b == "желтый" or b == "Желтый" or b == "Жёлтый" or b == "жёлтый":
#         print("Вторичный цвет - Зеленый")
#     else:
#         print("Другой цвет")
#
# else:
#     print("Ошибка")

